import '../../style/ofertaPage/ofertaPage.scss';

const OfertaPage = () => {

  return (
    <main>
      <div className="container">
        <h1>ПУБЛІЧНА ОФЕРТА</h1>
        <p>
          Цей документ є офіційною публічною пропозицією (офертою) Фізичної особи-підприємця Швець
          Євгенії Вікторівни (ІНН 3098008868), яка знаходиться за адресою: Україна, 27500,
          Кіровоградська обл., місто Світловодськ, вул. Ватутіна, будинок 5, щодо укладення договору
          про надання доступу до онлайн-курсів для барменів.
        </p>
        <p>
          Будь-яка особа, яка здійснює оплату за курси, погоджується з умовами цього договору
          (акцепт оферти).
        </p>
        <h2>1. Загальні положення</h2>
        <p>
          1.1. Цей договір укладається між ФОП Швець Євгенією Вікторівною (надалі — "Виконавець") та
          будь-якою фізичною особою, яка здійснює оплату за доступ до онлайн-курсів (надалі —
          "Замовник"). 1.2. Умови цієї оферти є обов'язковими для обох сторін.
        </p>
        <h2>2. Предмет договору</h2>
        <p>
          2.1. Виконавець зобов’язується надати Замовнику доступ до відеоматеріалів онлайн-курсу для
          барменів відповідно до вибраного тарифу, а Замовник зобов’язується оплатити послуги
          Виконавця.
        </p>
        <h2>3. Порядок оплати</h2>
        <p>
          3.1. Оплата за доступ до онлайн-курсів здійснюється виключно онлайн через платіжні
          сервіси, доступні на вебсайті Виконавця. 3.2. Факт оплати вважається підтвердженням згоди
          Замовника з умовами цього договору.
        </p>
        <h2>4. Надання доступу до матеріалів</h2>
        <p>
          4.1. Після підтвердження оплати Замовник отримує доступ до обраного курсу через особистий
          кабінет на платформі Виконавця. 4.2. Доступ до матеріалів надається на строк, зазначений у
          тарифі, вибраному Замовником.
        </p>
        <h2>5. Умови повернення коштів</h2>
        <p>5.1. Повернення коштів не передбачено.</p>
        <h2>6. Обов’язки Виконавця</h2>
        <p>
          6.1. Виконавець зобов’язується надати доступ до відеоматеріалів курсу після отримання
          оплати. 6.2. У випадку технічних проблем, через які Замовник не отримав доступу,
          Виконавець зобов’язується усунути проблему та надати доступ, якщо факт оплати було
          підтверджено.
        </p>
        <h2>7. Політика конфіденційності</h2>
        <p>
          7.1. Виконавець використовує персональні дані Замовника (електронну пошту та пароль)
          виключно для авторизації на платформі. 7.2. Виконавець гарантує, що не передає персональні
          дані Замовника третім особам.
        </p>
        <h2>8. Відповідальність сторін</h2>
        <p>
          8.1. Виконавець не несе відповідальності за дії Замовника, включаючи неправомірне
          використання матеріалів курсу. 8.2. У випадку виникнення спірних ситуацій, сторони
          намагаються вирішити їх шляхом переговорів.
        </p>
        <h2>9. Контактні дані</h2>
        <p>
          9.1. Виконавець доступний для зв’язку через офіційні медіаресурси, зазначені на сайті.
        </p>
        <p>
          Цей договір набирає чинності з моменту оплати Замовником та діє до моменту завершення
          надання послуг відповідно до умов обраного тарифу.
        </p>
      </div>
    </main>
  );
}
 
export default OfertaPage;